Revit 2024 API
TriangulationInterfaceForTriangulatedShellComponent Class
 This class is used to call FacetingUtils::convertTrianglesToQuads with a triangulation defined by a TriangulatedShellComponent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class TriangulationInterfaceForTriangulatedShellComponent : TriangulationInterface
Visual Basic
Public Class TriangulationInterfaceForTriangulatedShellComponent _
	Inherits TriangulationInterface
Visual C++
public ref class TriangulationInterfaceForTriangulatedShellComponent : public TriangulationInterface
Remarks
 Compare to TriangulationInterfaceForTriangulatedSolidOrShell, which treats with the entire solid or shell as a single triangulated structure.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TriangulationInterface
 Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedShellComponent
See Also
TriangulationInterfaceForTriangulatedShellComponent Members
Autodesk.Revit.DB Namespace